#+TITLE: k-NEAREST-NEIGBORS - BREAST CANCER PREDICTION
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: Case Study - Supervised lazy learner classifiers
#+STARTUP: overview hideblocks indent inlineimages
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :session *R* :results output :exports both :noweb yes
* Importing the data

- Import the CSV data file to a dataframe ~wbcd~ from url=[[http://bit.ly/3khqmkp][bit.ly/3khqmkp]]
  1) assume that the data have a header
  2) do not automatically convert strings (~chr~) into factors
  3) check the ~args~ of the importing function if you're not sure
  #+begin_src R
    args(read.csv)
  #+end_src

  #+name: get_wbcd
  #+begin_src R
    wbcd <- read.csv(
      file="http://bit.ly/3khqmkp",
      stringsAsFactors=FALSE)
  #+end_src

  #+RESULTS: get_wbcd

- Check the structure of the data frame:
  #+begin_src R
    str(wbcd)
  #+end_src

- The variable ~id~ is a unique identifier for each patient in the data.

- Regardless of ML method, ID variables *should always be excluded*: a
  model that includes an ID column will suffer from overfitting and
  generalize poor data - can you think why?[fn:2].

- Overwrite the data frame with itself after removing the first
  column, then check the first four examples and features only:
  #+name: remove_id
  #+begin_src R
    <<get_wbcd>>
    wbcd <- wbcd[-1]
    wbcd[1:4,1:4]
  #+end_src

  #+RESULTS:
  :   diagnosis radius_mean texture_mean perimeter_mean
  : 1         B       12.32        12.39          78.85
  : 2         B       10.60        18.95          69.28
  : 3         B       11.04        16.83          70.92
  : 4         B       11.28        13.39          73.00

* Exploring the ~diagnosis~ target data

- The ~wbcd[,2] = diagnosis~, is the outcome we want to predict: this
  feature indicates if the example is from a benign or malignant mass.

- How many examples are benign or malignant, respectively?
  #+begin_src R
    table(wbcd$diagnosis)
  #+end_src

  #+RESULTS:
  : 
  :   B   M 
  : 357 212

- kNN like many other ML classifiers require the target feature (aka
  class) to be coded as ~factor~ with ~levels~.

- We recode ~diagnosis~ as a ~factor~ and add the ~labels~ "Benign" and
  "Malignant" -  if you cannot remember ~factor~, run ~args~ on it!
  #+begin_src R
    <<remove_id>>
    wbcd$diagnosis <- factor(wbcd$diagnosis,
                             levels=c("B","M"),
                             labels=c("Benign","Malignant"))
    str(wbcd$diagnosis)
  #+end_src

  #+RESULTS:
  :   diagnosis radius_mean texture_mean perimeter_mean
  : 1         B       12.32        12.39          78.85
  : 2         B       10.60        18.95          69.28
  : 3         B       11.04        16.83          70.92
  : 4         B       11.28        13.39          73.00
  :  Factor w/ 2 levels "Benign","Malignant": 1 1 1 1 1 1 1 2 1 1 ...

- We visualize the frequencies of the two diagnoses in a barplot,
  coloring the benign results green, and the malignant results red:
  #+begin_src R :results graphics file :file data/5_diagnosis.png
    barplot(table(wbcd$diagnosis),
            col=c("green","red"),
            main=
              "Results of fine-needle biopsy in the\nWisconsin breast cancer data set")
  #+end_src

- To obtain the relative percentage of the diagnosis results, we look
  at the proportions table:
  #+begin_src R
    cat("Relative percentages of breast cancer\n")
    cat("masses in the Wisconsin data set:\n")
    round(prop.table(table(wbcd$diagnosis)) * 100, digits = 1)
  #+end_src

* Exploring the predictors

- The remaining 30 features are ~numeric~ and consist of
  different measurements of the 10 characteristics.

- List the first 3 rows of three of these predictors: ~radius_mean~,
  ~area_mean~, and ~smoothness_mean~:
  #+begin_src R
    wbcd[1:3,c("radius_mean","area_mean","smoothness_mean")]
  #+end_src

  #+RESULTS:
  :   radius_mean area_mean smoothness_mean
  : 1       12.32     464.1         0.10280
  : 2       10.60     346.4         0.09688
  : 3       11.04     373.2         0.10770

- Compute a statistical ~summary~ of these three features:
  #+begin_src R
    summary(wbcd[c("radius_mean","area_mean","smoothness_mean")])
  #+end_src

- What do you notice when looking at the values? Remember that
  distance calculation for k-NN depends on the measurement scale of
  the input.[fn:3]
  #+begin_src R
    range(wbcd["area_mean"])
    range(wbcd["smoothness_mean"])
  #+end_src

